{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point for the Internet Computer canister.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: removing the Google Maps iframe and adding a clickable Google Maps link with specific coordinates (25.039202,73.912804) in the Contact component.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing a luxury photography portfolio website with dark/gold theme, WhatsApp integration (7877283716), Instagram links (uc_photography_100), and various components for services, portfolio, reviews, and contact.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a dark luxury theme with gold accents, including light and dark mode color schemes using HSL values.",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags, Open Graph properties, and LocalBusiness structured data schema for UC Photography & Film's wedding photography business in Rajasthan.",
  "frontend/src/App.tsx": "Main React application component that assembles and renders all page sections including Header, Hero, Services, Portfolio, About, Reviews, BookingCTA, Contact, Footer, and FloatingWhatsApp components.",
  "frontend/src/components/About.tsx": "About section component featuring a two-column layout with photographer image and business description text, using scroll animations and gold accent styling.",
  "frontend/src/components/BookingCTA.tsx": "Call-to-action section with urgency messaging and a prominent WhatsApp booking button linking to 917877283716 with pre-filled message, styled with gold gradient background.",
  "frontend/src/components/Contact.tsx": "Contact section with phone number (7877283716), contact form, studio location card with clickable Google Maps link (https://maps.google.com/?q=25.039202,73.912804), WhatsApp button, and Instagram link.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed floating WhatsApp button positioned at bottom-right corner with pulse animation, linking to 917877283716 with pre-filled booking inquiry message.",
  "frontend/src/components/Footer.tsx": "Footer component with logo, navigation links, contact information (7877283716), social media links (WhatsApp and Instagram uc_photography_100), copyright notice, and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Fixed header component with responsive navigation, scroll effects, and mobile menu toggle. Includes logo, nav links, Instagram icon, and a 'Book Now' CTA button.",
  "frontend/src/components/Hero.tsx": "Hero section with full-screen background image, animated heading, and WhatsApp booking CTA. Features gradient overlay and animated scroll indicator.",
  "frontend/src/components/Lightbox.tsx": "Full-screen image lightbox modal with keyboard navigation (arrows, escape), previous/next buttons, and image counter display.",
  "frontend/src/components/Portfolio.tsx": "Portfolio gallery with category filtering (Wedding, Events, Promotion, etc.), responsive grid layout, and lightbox integration for viewing images.",
  "frontend/src/components/Reviews.tsx": "Client reviews section displaying testimonials in a carousel with star ratings, review text, and client names.",
  "frontend/src/components/Services.tsx": "Services showcase grid displaying six photography/videography service types with icons, images, titles, and descriptions in hover-animated cards.",
  "frontend/src/hooks/useActor.ts": "React hook for managing Internet Identity authentication and creating backend actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useScrollAnimation.ts": "React hook using IntersectionObserver to detect when an element becomes visible in viewport, triggering scroll-based animations with configurable threshold.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration defining a black/gold/white luxury theme, custom animations (fadeIn, slideIn, zoomIn), custom scrollbar styling, and typography using Playfair Display and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom gold colors, shadows, animations, and typography/container-queries plugins for the luxury photography portfolio design system.",
  "project_state.json": "Project metadata documenting a premium photography portfolio website with dark luxury theme, listing architectural decisions, contact details (WhatsApp: 7877283716, Instagram, Google Maps location), and implemented features for UC Photography & Film's."
}