{
  "backend/main.mo": "Empty Motoko actor file serving as the backend entry point for the Internet Computer canister.",
  "feature_evidence.json": "Feature evidence report documenting the Google site verification meta tag update in frontend/index.html with content \"3JcpygsB7VEyNJC7\".",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, hooks, configuration, and styling for the UC Photography portfolio website.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, including color tokens, radius, and sidebar styling.",
  "frontend/index.html": "HTML entry point with SEO meta tags, Google site verification (content=\"3JcpygsB7VEyNJC7\"), Open Graph tags, and LocalBusiness structured data schema.",
  "frontend/src/App.tsx": "Main React application component that renders the full photography portfolio layout including header, hero, services, portfolio, about, reviews, booking CTA, contact, footer, and floating WhatsApp button.",
  "frontend/src/components/About.tsx": "About section component with two-column responsive layout displaying photographer image and UC Photography introduction text with scroll animation.",
  "frontend/src/components/BookingCTA.tsx": "Call-to-action section with urgency messaging and WhatsApp booking button linking to 7877283716 with gold gradient background.",
  "frontend/src/components/Contact.tsx": "Contact section with phone number (7877283716), contact form, Google Maps link (25.039202,73.912804), WhatsApp button, and Instagram link to uc_photography_100.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed floating WhatsApp button at bottom-right corner linking to 7877283716 with pre-filled message and pulse animation.",
  "frontend/src/components/Footer.tsx": "Footer component with logo, navigation links, contact information (7877283716), WhatsApp link, Instagram link (uc_photography_100), copyright, and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Fixed header component with responsive navigation, scroll effects, and mobile menu. Includes logo, nav links, Instagram icon, and a 'Book Now' button that scrolls to sections.",
  "frontend/src/components/Hero.tsx": "Hero section with full-screen background image, animated heading, and WhatsApp booking button. Features scroll indicator and fade-in animation on mount.",
  "frontend/src/components/Lightbox.tsx": "Modal lightbox component for viewing images in fullscreen with previous/next navigation, keyboard controls (Escape, arrows), and image counter display.",
  "frontend/src/components/Portfolio.tsx": "Portfolio gallery with category filtering (Wedding, Events, Promotion, etc.), grid layout, and lightbox integration. Uses scroll animations and lazy loading for images.",
  "frontend/src/components/Reviews.tsx": "Client reviews section displaying testimonials in a carousel with star ratings. Shows 5-star reviews from wedding and event clients with responsive card layout.",
  "frontend/src/components/Services.tsx": "Services showcase grid displaying six photography/videography offerings (weddings, events, promotions, etc.) with icons, images, and hover effects using cards.",
  "frontend/src/hooks/useActor.ts": "React Query hook for managing Internet Identity authentication and creating backend actors. Handles authenticated and anonymous actors, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useScrollAnimation.ts": "React hook using IntersectionObserver to detect when an element becomes visible in viewport, returning a ref and visibility state for scroll-triggered animations.",
  "frontend/src/index.css": "Global CSS with Tailwind setup, black/gold/white theme variables, custom animations (fadeIn, slideIn, zoomIn), gold utility classes, and custom scrollbar styling using Playfair Display and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClient and InternetIdentityProvider wrappers for React Query and ICP authentication.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with custom colors (gold variants, HSL-based design tokens), typography plugin, container queries, animations, and Playfair Display/Inter font families.",
  "project_state.json": "Project metadata defining a premium photography portfolio website for UC Photography & Film's with dark luxury theme, listing architectural decisions, contact details (WhatsApp: 7877283716, Instagram, Google Maps coordinates), and implemented features for hero, services, portfolio, about, reviews, and contact sections."
}