{
  "backend/main.mo": "Empty Motoko actor file serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON object containing detailed summaries of all frontend React components, hooks, configuration files, and HTML entry point for the UC Photography portfolio website.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color schemes, borders, and design tokens using HSL color space.",
  "frontend/index.html": "HTML entry point with SEO meta tags, Google site verification (3JcpygsB7VEyNJC7), Open Graph tags, and LocalBusiness structured data schema for UC Photography.",
  "frontend/src/App.tsx": "Root React component that assembles and renders all major sections of the photography portfolio website including header, hero, services, portfolio, about, reviews, booking CTA, contact, footer, and floating WhatsApp button.",
  "frontend/src/components/About.tsx": "About section component with two-column responsive layout displaying photographer image with decorative gold border and company description text with scroll animation.",
  "frontend/src/components/BookingCTA.tsx": "Call-to-action section with urgency messaging and WhatsApp booking button linking to 7877283716 with gold gradient background and scale animation.",
  "frontend/src/components/Contact.tsx": "Contact section featuring phone number (7877283716), contact form with validation, Google Maps link (25.039202,73.912804), WhatsApp and Instagram buttons with dark luxury card styling.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed position floating WhatsApp button at bottom-right corner linking to 7877283716 with pulse animation and hover effects.",
  "frontend/src/components/Footer.tsx": "Footer component with logo, quick navigation links, contact information (phone 7877283716, WhatsApp, Instagram uc_photography_100), copyright notice, and caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Fixed navigation header component with responsive mobile menu, smooth scroll navigation to page sections, Instagram link, and a 'Book Now' CTA button. Changes background opacity on scroll.",
  "frontend/src/components/Hero.tsx": "Hero section component with full-screen background image, animated heading and tagline, and a WhatsApp booking button with pre-filled message. Includes scroll indicator animation.",
  "frontend/src/components/Lightbox.tsx": "Modal lightbox component for viewing portfolio images with keyboard navigation (arrows, escape), previous/next buttons, and image counter display.",
  "frontend/src/components/Portfolio.tsx": "Portfolio gallery component with category filtering (Wedding, Events, Promotion, Functions, Cinematic), grid layout of images, and lightbox integration for full-size viewing.",
  "frontend/src/components/Reviews.tsx": "Client testimonials section displaying 5-star reviews in a carousel layout with star ratings, review text, and client names.",
  "frontend/src/components/Services.tsx": "Services showcase section displaying six photography/videography service offerings in a responsive card grid with icons, images, titles, and descriptions.",
  "frontend/src/hooks/useActor.ts": "React hook for managing Internet Computer actor instances with authentication support, creating anonymous or authenticated actors based on Internet Identity login state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useScrollAnimation.ts": "React hook using IntersectionObserver to trigger visibility state when an element scrolls into view based on a configurable threshold.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration defining a black/gold/white theme, custom animations (fadeIn, slideIn, zoomIn), and custom scrollbar styling using CSS variables.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for React Query and ICP authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (gold variants), typography, animations, and container settings for the black/gold/white design system.",
  "project_state.json": "Project metadata tracking a pending feature request (AR-1) to deploy the application to production on the Internet Computer network."
}