{
  "backend/main.mo": "Empty Motoko actor definition serving as the backend entry point for the Internet Computer canister.",
  "feature_evidence.json": "Feature evidence report documenting the addition of Google site verification meta tag to frontend/index.html with high confidence and associated test ID REQ-33.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, hooks, and configuration for the UC Photography portfolio website.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color tokens, spacing, and design system values.",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags including Google site verification (3JcpygsB7VEyNJC7...), Open Graph tags, and LocalBusiness structured data schema.",
  "frontend/src/App.tsx": "Root React component that assembles and renders all page sections (Header, Hero, Services, Portfolio, About, Reviews, BookingCTA, Contact, Footer, FloatingWhatsApp) in a dark-themed layout.",
  "frontend/src/components/About.tsx": "About section component with two-column responsive layout displaying photographer image with decorative gold border and UC Photography introduction text with scroll animation.",
  "frontend/src/components/BookingCTA.tsx": "Call-to-action section with urgency messaging and WhatsApp booking button linking to 7877283716 with gold gradient background and scale-on-hover animation.",
  "frontend/src/components/Contact.tsx": "Contact section with phone (7877283716), location with Google Maps link (25.039202,73.912804), contact form, WhatsApp button, and Instagram link (uc_photography_100) in dark card layout.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed bottom-right floating WhatsApp button with pulse animation linking to 7877283716 with pre-filled booking inquiry message.",
  "frontend/src/components/Footer.tsx": "Footer component with logo, quick navigation links, contact info (phone 7877283716, WhatsApp, Instagram uc_photography_100), copyright notice, and caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Fixed header component with responsive navigation, scroll effects, and mobile menu toggle. Includes smooth scrolling to page sections, Instagram link, and a 'Book Now' CTA button.",
  "frontend/src/components/Hero.tsx": "Hero section component with full-screen background image, animated text reveal, and WhatsApp booking CTA. Features gradient overlay and animated scroll indicator.",
  "frontend/src/components/Lightbox.tsx": "Modal lightbox component for viewing portfolio images with keyboard navigation (arrows, escape), previous/next buttons, and image counter display.",
  "frontend/src/components/Portfolio.tsx": "Portfolio gallery component with category filtering (Wedding, Events, Promotion, etc.), grid layout, and lightbox integration for viewing images.",
  "frontend/src/components/Reviews.tsx": "Client reviews section displaying testimonials in a carousel with star ratings, using shadcn/ui Card and Carousel components.",
  "frontend/src/components/Services.tsx": "Services showcase section displaying six photography/videography service cards with icons, images, and hover effects in a responsive grid layout.",
  "frontend/src/hooks/useActor.ts": "React hook for managing Internet Computer actor instances with authentication, using React Query for caching and automatic invalidation when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useScrollAnimation.ts": "React hook using IntersectionObserver to trigger visibility state when an element scrolls into view based on a configurable threshold.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration defining a black/gold/white luxury theme, custom animations (fadeIn, slideIn, zoomIn), scrollbar styling, and typography using Playfair Display and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom gold colors, shadows, animations, and typography/container-queries plugins for the luxury photography portfolio design system.",
  "project_state.json": "Project metadata documenting a premium photography portfolio website with dark luxury theme, listing architectural decisions, contact details (WhatsApp: 7877283716, Instagram link, Google Maps coordinates), and implemented features for UC Photography & Film's."
}