{
  "backend/main.mo": "Empty Motoko actor file serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON object containing summaries of all frontend React components, hooks, and configuration files for the UC Photography portfolio website, including contact details (phone: 7877283716, Instagram: uc_photography_100) and Google site verification.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color schemes, borders, shadows, and sidebar styling using HSL color values.",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags, Google site verification (3JcpygsB7VEyNJC7), Open Graph tags, and LocalBusiness structured data schema for UC Photography & Film's.",
  "frontend/src/App.tsx": "Root React component that assembles and renders all page sections (Header, Hero, Services, Portfolio, About, Reviews, BookingCTA, Contact, Footer, FloatingWhatsApp) in a dark-themed layout.",
  "frontend/src/components/About.tsx": "About section component with two-column responsive layout displaying photographer image with decorative gold border and company description text with scroll animation.",
  "frontend/src/components/BookingCTA.tsx": "Call-to-action section with urgency messaging and WhatsApp booking button linking to 7877283716 with gold gradient background and scale animation.",
  "frontend/src/components/Contact.tsx": "Contact section with phone number (7877283716), contact form, Google Maps link (25.039202,73.912804), WhatsApp button, and Instagram link (uc_photography_100) in dark card layout.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed floating WhatsApp button positioned at bottom-right corner linking to 7877283716 with pulse animation and pre-filled booking message.",
  "frontend/src/components/Footer.tsx": "Footer component with logo, navigation links, contact information (7877283716, WhatsApp, Instagram uc_photography_100), copyright notice, and caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Fixed header component with scroll-based styling, desktop/mobile navigation menus, smooth scrolling to page sections, and links to Instagram and booking. Includes logo, nav links (Home, Portfolio, Services, About, Reviews, Contact), and a mobile hamburger menu.",
  "frontend/src/components/Hero.tsx": "Hero section component displaying a full-screen background image with overlay, animated heading/subheading about photography services, and a WhatsApp booking button with pre-filled message. Includes a scroll indicator animation.",
  "frontend/src/components/Lightbox.tsx": "Modal lightbox component for viewing images in fullscreen with navigation controls (previous/next buttons, keyboard arrows, ESC to close) and image counter. Prevents body scroll when open.",
  "frontend/src/components/Portfolio.tsx": "Portfolio gallery section with category filters (All, Wedding, Events, Promotion, Functions, Cinematic), grid layout of images, and click-to-open lightbox functionality. Uses scroll animation hook for entrance effects.",
  "frontend/src/components/Reviews.tsx": "Client reviews section displaying testimonials in a carousel with star ratings, review text, and client names. Uses scroll animation for entrance effect and responsive card layout.",
  "frontend/src/components/Services.tsx": "Services showcase section displaying six photography/videography service cards (Wedding, Pre-Wedding, Events, Promotion, Birthday, Cinematic) with icons, images, titles, and descriptions in a responsive grid with hover effects.",
  "frontend/src/hooks/useActor.ts": "React hook for managing Internet Computer actor instances with authentication support. Creates authenticated or anonymous actors based on Internet Identity state, caches with React Query, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useScrollAnimation.ts": "React hook using IntersectionObserver to trigger visibility state when an element scrolls into view based on a configurable threshold.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration defining a black/gold/white luxury theme, custom animations (fadeIn, slideIn, zoomIn), scrollbar styling, and typography using Playfair Display and Inter fonts.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom colors (gold variants, HSL-based design tokens), animations, shadows, and font families for the luxury photography portfolio design system.",
  "project_state.json": "Project metadata documenting a premium photography portfolio website with dark luxury theme, architectural decisions, contact details (WhatsApp: 7877283716, Instagram, Google Maps location), and implemented features including header, hero, services, gallery, about, reviews, and contact sections."
}